ABI-EIT/EIT-Device-Firmware/drivers/devices/MK66F18/startup/startup_baremetal.c
//*****************************************************************************
// MK66F18 startup code for use with MCUXpresso IDE
//
// Version : 160420
//*****************************************************************************
//
// Copyright 2016-2020 NXP
// All rights reserved.
//
// SPDX-License-Identifier: BSD-3-Clause
// The BSD 3 Clause License
// 
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions are met:
// 
// 1. Redistributions of source code must retain the above copyright notice, this
// list of conditions and the following disclaimer.
// 
// 2. Redistributions in binary form must reproduce the above copyright notice,
// this list of conditions and the following disclaimer in the documentation
// and/or other materials provided with the distribution.
// 
// 3. Neither the name of the copyright holder nor the names of its contributors
// may be used to endorse or promote products derived from this software without
// specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
// ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
// WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
// DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
// FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
// DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
// SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
// CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
// OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.
// 
//*****************************************************************************


#pragma GCC push_options
#pragma GCC optimize ("Og")



#if defined (__cplusplus)
#ifdef __REDLIB__
#error Redlib does not support C++
#else
//*****************************************************************************
//
// The entry point for the C++ library startup
//
//*****************************************************************************
extern "C" {
    extern void __libc_init_array(void);
}
#endif
#endif

#define AV __attribute__ ((section(".after_vectors")))

//*****************************************************************************
#if defined (__cplusplus)
extern "C" {
#endif

//*****************************************************************************
// Flash Configuration block : 16-byte flash configuration field that stores
// default protection settings (loaded on reset) and security information that
// allows the MCU to restrict access to the Flash Memory module.
// Placed at address 0x400 by the linker script.
//*****************************************************************************
//__attribute__ ((used,section(".FlashConfig"))) const struct {
//    unsigned int word1;
//    unsigned int word2;
//    unsigned int word3;
//    unsigned int word4;
//} Flash_Config = {0xFFFFFFFF, 0xFFFFFFFF, 0xFFFFFFFF, 0xFFFFFFFE};

// Flash Security Setting. On Teensy 3.2, you can lock the MK20 chip to prevent
// anyone from reading your code.  You CAN still reprogram your Teensy while
// security is set, but the bootloader will be unable to respond to auto-reboot
// requests from Arduino. Pressing the program button will cause a full chip
// erase to gain access, because the bootloader chip is locked out.  Normally,
// erase occurs when uploading begins, so if you press the Program button
// accidentally, simply power cycling will run your program again.  When
// security is locked, any Program button press causes immediate full erase.
// Special care must be used with the Program button, because it must be made
// accessible to initiate reprogramming, but it must not be accidentally
// pressed when Teensy Loader is not being used to reprogram.  To set lock the
// security change this to 0xDC.  Teensy 3.0 and 3.1 do not support security lock.
#define FSEC 0xDE

// Flash Options
#define FOPT 0xF9

__attribute__ ((section(".flashconfig"), used))
const unsigned char flashconfigbytes[16] = {
	0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
	0xFF, 0xFF, 0xFF, 0xFF, FSEC, FOPT, 0xFF, 0xFF
};

//*****************************************************************************
// Declaration of external SystemInit function
//*****************************************************************************
#if defined (__USE_CMSIS)
extern void SystemInit(void);
#endif // (__USE_CMSIS)

//*****************************************************************************
// Forward declaration of the core exception handlers.
// When the application defines a handler (with the same name), this will
// automatically take precedence over these weak definitions.
// If your application is a C++ one, then any interrupt handlers defined
// in C++ files within in your main application will need to have C linkage
// rather than C++ linkage. To do this, make sure that you are using extern "C"
// { .... } around the interrupt handler within your main application code.
//*****************************************************************************
     void ResetISR(void);
AV void NMI_Handler(void);
AV void HardFault_Handler(void);
AV void MemManage_Handler(void);
AV void BusFault_Handler(void);
AV void UsageFault_Handler(void);
AV void SVC_Handler(void);
AV void DebugMon_Handler(void);
AV void PendSV_Handler(void);
AV void SysTick_Handler(void);
AV void IntDefaultHandler(void);
//*****************************************************************************
// Forward declaration of the application IRQ handlers. When the application
// defines a handler (with the same name), this will automatically take
// precedence over weak definitions below
//*****************************************************************************
extern void DMA0_DMA16_IRQHandler(void);
extern void DMA1_DMA17_IRQHandler(void);
extern void DMA2_DMA18_IRQHandler(void);
extern void DMA3_DMA19_IRQHandler(void);
extern void DMA4_DMA20_IRQHandler(void);
extern void DMA5_DMA21_IRQHandler(void);
extern void DMA6_DMA22_IRQHandler(void);
extern void DMA7_DMA23_IRQHandler(void);
extern void DMA8_DMA24_IRQHandler(void);
extern void DMA9_DMA25_IRQHandler(void);
extern void DMA10_DMA26_IRQHandler(void);
extern void DMA11_DMA27_IRQHandler(void);
extern void DMA12_DMA28_IRQHandler(void);
extern void DMA13_DMA29_IRQHandler(void);
extern void DMA14_DMA30_IRQHandler(void);
extern void DMA15_DMA31_IRQHandler(void);
extern void DMA_Error_IRQHandler(void);
extern void MCM_IRQHandler(void);
extern void FTFE_IRQHandler(void);
extern void Read_Collision_IRQHandler(void);
extern void LVD_LVW_IRQHandler(void);
extern void LLWU_IRQHandler(void);
extern void WDOG_EWM_IRQHandler(void);
extern void RNG_IRQHandler(void);
extern void I2C0_IRQHandler(void);
extern void I2C1_IRQHandler(void);
extern void SPI0_IRQHandler(void);
extern void SPI1_IRQHandler(void);
extern void I2S0_Tx_IRQHandler(void);
extern void I2S0_Rx_IRQHandler(void);
extern void Reserved46_IRQHandler(void);
extern void UART0_RX_TX_IRQHandler(void);
extern void UART0_ERR_IRQHandler(void);
extern void UART1_RX_TX_IRQHandler(void);
extern void UART1_ERR_IRQHandler(void);
extern void UART2_RX_TX_IRQHandler(void);
extern void UART2_ERR_IRQHandler(void);
extern void UART3_RX_TX_IRQHandler(void);
extern void UART3_ERR_IRQHandler(void);
extern void ADC0_IRQHandler(void);
extern void CMP0_IRQHandler(void);
extern void CMP1_IRQHandler(void);
extern void FTM0_IRQHandler(void);
extern void FTM1_IRQHandler(void);
extern void FTM2_IRQHandler(void);
extern void CMT_IRQHandler(void);
extern void RTC_IRQHandler(void);
extern void RTC_Seconds_IRQHandler(void);
extern void PIT0_IRQHandler(void);
extern void PIT1_IRQHandler(void);
extern void PIT2_IRQHandler(void);
extern void PIT3_IRQHandler(void);
extern void PDB0_IRQHandler(void);
extern void USB0_IRQHandler(void);
extern void USBDCD_IRQHandler(void);
extern void Reserved71_IRQHandler(void);
extern void DAC0_IRQHandler(void);
extern void MCG_IRQHandler(void);
extern void LPTMR0_IRQHandler(void);
extern void PORTA_IRQHandler(void);
extern void PORTB_IRQHandler(void);
extern void PORTC_IRQHandler(void);
extern void PORTD_IRQHandler(void);
extern void PORTE_IRQHandler(void);
extern void SWI_IRQHandler(void);
extern void SPI2_IRQHandler(void);
extern void UART4_RX_TX_IRQHandler(void);
extern void UART4_ERR_IRQHandler(void);
extern void Reserved84_IRQHandler(void);
extern void Reserved85_IRQHandler(void);
extern void CMP2_IRQHandler(void);
extern void FTM3_IRQHandler(void);
extern void DAC1_IRQHandler(void);
extern void ADC1_IRQHandler(void);
extern void I2C2_IRQHandler(void);
extern void CAN0_ORed_Message_buffer_IRQHandler(void);
extern void CAN0_Bus_Off_IRQHandler(void);
extern void CAN0_Error_IRQHandler(void);
extern void CAN0_Tx_Warning_IRQHandler(void);
extern void CAN0_Rx_Warning_IRQHandler(void);
extern void CAN0_Wake_Up_IRQHandler(void);
extern void SDHC_IRQHandler(void);
extern void ENET_1588_Timer_IRQHandler(void);
extern void ENET_Transmit_IRQHandler(void);
extern void ENET_Receive_IRQHandler(void);
extern void ENET_Error_IRQHandler(void);
extern void LPUART0_IRQHandler(void);
extern void TSI0_IRQHandler(void);
extern void TPM1_IRQHandler(void);
extern void TPM2_IRQHandler(void);
extern void USBHSDCD_IRQHandler(void);
extern void I2C3_IRQHandler(void);
extern void CMP3_IRQHandler(void);
extern void USBHS_IRQHandler(void);
extern void CAN1_ORed_Message_buffer_IRQHandler(void);
extern void CAN1_Bus_Off_IRQHandler(void);
extern void CAN1_Error_IRQHandler(void);
extern void CAN1_Tx_Warning_IRQHandler(void);
extern void CAN1_Rx_Warning_IRQHandler(void);
extern void CAN1_Wake_Up_IRQHandler(void);

//*****************************************************************************
// Forward declaration of the driver IRQ handlers. These are aliased
// to the IntDefaultHandler, which is a 'forever' loop. When the driver
// defines a handler (with the same name), this will automatically take
// precedence over these weak definitions
//*****************************************************************************
extern void DMA0_DMA16_DriverIRQHandler(void);
extern void DMA1_DMA17_DriverIRQHandler(void);
extern void DMA2_DMA18_DriverIRQHandler(void);
extern void DMA3_DMA19_DriverIRQHandler(void);
extern void DMA4_DMA20_DriverIRQHandler(void);
extern void DMA5_DMA21_DriverIRQHandler(void);
extern void DMA6_DMA22_DriverIRQHandler(void);
extern void DMA7_DMA23_DriverIRQHandler(void);
extern void DMA8_DMA24_DriverIRQHandler(void);
extern void DMA9_DMA25_DriverIRQHandler(void);
extern void DMA10_DMA26_DriverIRQHandler(void);
extern void DMA11_DMA27_DriverIRQHandler(void);
extern void DMA12_DMA28_DriverIRQHandler(void);
extern void DMA13_DMA29_DriverIRQHandler(void);
extern void DMA14_DMA30_DriverIRQHandler(void);
extern void DMA15_DMA31_DriverIRQHandler(void);
extern void DMA_Error_DriverIRQHandler(void);
extern void MCM_DriverIRQHandler(void);
extern void FTFE_DriverIRQHandler(void);
extern void Read_Collision_DriverIRQHandler(void);
extern void LVD_LVW_DriverIRQHandler(void);
extern void LLWU_DriverIRQHandler(void);
extern void WDOG_EWM_DriverIRQHandler(void);
extern void RNG_DriverIRQHandler(void);
extern void I2C0_DriverIRQHandler(void);
extern void I2C1_DriverIRQHandler(void);
extern void SPI0_DriverIRQHandler(void);
extern void SPI1_DriverIRQHandler(void);
extern void I2S0_Tx_DriverIRQHandler(void);
extern void I2S0_Rx_DriverIRQHandler(void);
extern void Reserved46_DriverIRQHandler(void);
extern void UART0_RX_TX_DriverIRQHandler(void);
extern void UART0_ERR_DriverIRQHandler(void);
extern void UART1_RX_TX_DriverIRQHandler(void);
extern void UART1_ERR_DriverIRQHandler(void);
extern void UART2_RX_TX_DriverIRQHandler(void);
extern void UART2_ERR_DriverIRQHandler(void);
extern void UART3_RX_TX_DriverIRQHandler(void);
extern void UART3_ERR_DriverIRQHandler(void);
extern void ADC0_DriverIRQHandler(void);
extern void CMP0_DriverIRQHandler(void);
extern void CMP1_DriverIRQHandler(void);
extern void FTM0_DriverIRQHandler(void);
extern void FTM1_DriverIRQHandler(void);
extern void FTM2_DriverIRQHandler(void);
extern void CMT_DriverIRQHandler(void);
extern void RTC_DriverIRQHandler(void);
extern void RTC_Seconds_DriverIRQHandler(void);
extern void PIT0_DriverIRQHandler(void);
extern void PIT1_DriverIRQHandler(void);
extern void PIT2_DriverIRQHandler(void);
extern void PIT3_DriverIRQHandler(void);
extern void PDB0_DriverIRQHandler(void);
extern void USB0_DriverIRQHandler(void);
extern void USBDCD_DriverIRQHandler(void);
extern void Reserved71_DriverIRQHandler(void);
extern void DAC0_DriverIRQHandler(void);
extern void MCG_DriverIRQHandler(void);
extern void LPTMR0_DriverIRQHandler(void);
extern void PORTA_DriverIRQHandler(void);
extern void PORTB_DriverIRQHandler(void);
extern void PORTC_DriverIRQHandler(void);
extern void PORTD_DriverIRQHandler(void);
extern void PORTE_DriverIRQHandler(void);
extern void SWI_DriverIRQHandler(void);
extern void SPI2_DriverIRQHandler(void);
extern void UART4_RX_TX_DriverIRQHandler(void);
extern void UART4_ERR_DriverIRQHandler(void);
extern void Reserved84_DriverIRQHandler(void);
extern void Reserved85_DriverIRQHandler(void);
extern void CMP2_DriverIRQHandler(void);
extern void FTM3_DriverIRQHandler(void);
extern void DAC1_DriverIRQHandler(void);
extern void ADC1_DriverIRQHandler(void);
extern void I2C2_DriverIRQHandler(void);
extern void CAN0_DriverIRQHandler(void);
extern void SDHC_DriverIRQHandler(void);
extern void ENET_1588_Timer_DriverIRQHandler(void);
extern void ENET_Transmit_DriverIRQHandler(void);
extern void ENET_Receive_DriverIRQHandler(void);
extern void ENET_Error_DriverIRQHandler(void);
extern void LPUART0_DriverIRQHandler(void);
extern void TSI0_DriverIRQHandler(void);
extern void TPM1_DriverIRQHandler(void);
extern void TPM2_DriverIRQHandler(void);
extern void USBHSDCD_DriverIRQHandler(void);
extern void I2C3_DriverIRQHandler(void);
extern void CMP3_DriverIRQHandler(void);
extern void USBHS_DriverIRQHandler(void);
extern void CAN1_DriverIRQHandler(void);

//*****************************************************************************
// The entry point for the application.
// __main() is the entry point for Redlib based applications
// main() is the entry point for Newlib based applications
//*****************************************************************************
#if defined (__REDLIB__)
extern void __main(void);
#else
extern int main(void);
#endif

//*****************************************************************************
// External declaration for the pointer to the stack top from the Linker Script
//*****************************************************************************
//extern void _vStackTop(void);
extern unsigned long _estack;
//*****************************************************************************
#if defined (__cplusplus)
} // extern "C"
#endif
//*****************************************************************************
// The vector table.
// This relies on the linker script to place at correct location in memory.
//*****************************************************************************

__attribute__ ((section(".dmabuffers"), used, aligned(512)))

void (* const g_pfnVectors[])(void);
//extern void * __Vectors __attribute__ ((alias ("g_pfnVectors")));
extern void * _VectorsFlash __attribute__ ((alias ("g_pfnVectors")));

void (* _VectorsRam[sizeof(_VectorsFlash)])(void);

__attribute__ ((used, section(".vectors")))
void (* const g_pfnVectors[])(void) = {
    // Core Level - CM4
    (void (*)(void))((unsigned long)&_estack),// The initial stack pointer
    ResetISR,                          // The reset handler
    NMI_Handler,                       // The NMI handler
    HardFault_Handler,                 // The hard fault handler
    MemManage_Handler,                 // The MPU fault handler
    BusFault_Handler,                  // The bus fault handler
    UsageFault_Handler,                // The usage fault handler
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    SVC_Handler,                       // SVCall handler
    DebugMon_Handler,                  // Debug monitor handler
    0,                                 // Reserved
    PendSV_Handler,                    // The PendSV handler
    SysTick_Handler,                   // The SysTick handler

